#იტერაცია არის პროცესი, როდესაც რაღაც მოქმედება ან ოპერაცია მრავალი ჯერ გაიმეორებინება
#Sequencing გულისხმობს მოქმედებების თანმიმდევრობას
#Selection არის პროცესის არჩევანი, სადაც პირობაზე დამყარებით ხდება გადაწყვეტილება, თუ რომელი მოქმედება უნდა გაკეთდეს




#3

name = "Nikolozi"
age = 11
height = 1.45

if age > 11 and name == "Nikolozi" and height > 1.45:
   print("Conditions are met.")
else:
   print("Conditions are not met.")
    
    
    #2
    
    
#<: ნაკლებია

#=: მეტია ან ტოლი


#<=: ნაკლებია ან ტოლი


#2. ლოგიკური ოპერატორები:

#and: ორივე პირობა უნდა იყოს სწორი

#or: ერთი პირობა უნდა იყოს სწორი

#not: ახდენს პირობის წინააღმდეგობას


#4
#flowchart განიხილავს ალგორითმებს ვიზუალურად, ნაბიჯ-ნაბიჯ კავშირების კვალობაზე.

#Pseudocode გამოიყენება ალგორითმების ლოგიკის აღწერისთვის და ანალიზისთვის, თუმცა იგი პროგრამირების ენიდან დამოუკიდებელია.

#Natural language წარმოადგენს ყველაზე მარტივ გამოსახვის ფორმას, რომელსაც ხშირად იყენებენ მოტივირებული ადამიანური კომუნიკაციისთვის.


#5

#ალგორითმი არის ნაბიჯების თანმიმდევრობა რომელიც კონკრეტული ამოცანის ან პრობლემის გადაწყვეტისთვის უნდა შესრულდეს
#რეალური მაგალითები
# ტელევიზორის ჩართვა - ჩართე დააყენე არხი დააყენე ხმის დონე
#2. საკვების მომზადება - შეაგროვე ინგრედიენტები გაათბე ტაფა მოამზადე საჭმელი
#3. ონლაინ მაღაზიაში ყიდვა - მოძებნე პროდუქტი შეადარე ფასები შეიძინე